import enum
from pydantic import BaseModel, Field, validator

examples = [(
    """雨村笑道：“我如何得知。”门子冷笑道：“这人算来还是老爷的大恩人呢！
    他就是葫芦庙旁住的甄老爷的小姐，名唤英莲的。”雨村罕然道：“原来就是他！闻得养至五岁被人拐去，却如今才来卖呢？”
    雨村听了，亦叹道：“这也是他们的孽障遭遇，亦非偶然。不然这冯渊如何偏只看准了这英莲？这英莲受了拐子这几年折磨，才得了个头路，且又是个多情的，若能聚合了，倒是件美事，偏又生出这段事来。这薛家纵比冯家富贵，
    想其为人，自然姬妾众多，淫佚无度，未必及冯渊定情于一人者。这正是梦幻情缘，恰遇一对薄命儿女。且不要议论他，只目今这官司，如何剖断才好？”
    门子笑道：“老爷当年何其明决，今日何反成了个没主意的人了！小的闻得老爷补升此任，亦系贾府王府之力，此薛蟠即贾府之亲，老爷何不顺水行舟，作个整人情，
    将此案了结，日后也好去见贾府王府。”
    """,
    [
        {
            "speaker": "雨村",
            "dialogue": "我如何得知。",
            "action": "对话"
        },
        {
            "speaker": "门子",
            "dialogue": "这人算来还是老爷的大恩人呢！他就是葫芦庙旁住的甄老爷的小姐，名唤英莲的。",
            "action": "对话"
        },
        {
            "speaker": "雨村",
            "dialogue": "原来就是他！闻得养至五岁被人拐去，却如今才来卖呢？",
            "action": "对话"
        },
        {
            "speaker": "雨村",
            "dialogue": "这也是他们的孽障遭遇，亦非偶然。不然这冯渊如何偏只看准了这英莲？这英莲受了拐子这几年折磨，才得了个头路，且又是个多情的，若能聚合了，倒是件美事，偏又生出这段事来。这薛家纵比冯家富贵，想其为人，自然姬妾众多，淫佚无度，未必及冯渊定情于一人者。这正是梦幻情缘，恰遇一对薄命儿女。且不要议论他，只目今这官司，如何剖断才好？",
            "action": "对话"
        },
        {
            "speaker": "门子",
            "dialogue": "老爷当年何其明决，今日何反成了个没主意的人了！小的闻得老爷补升此任，亦系贾府王府之力，此薛蟠即贾府之亲，老爷何不顺水行舟，作个整人情，将此案了结，日后也好去见贾府王府。",
            "action": "对话"
        },
    ]
)]

description = "红楼梦对话提取，提取红楼梦中的对话和独白，输出说话人，对话内容，对话类型。"

many = True

class Action(enum.Enum):
    SAY = "对话"
    THINK = "独白"

# 设置Schema
class PersonDialogue(BaseModel):

    speaker: str = Field(
        description="对话的发起者，说话的人，或者发出内心独白的人。",
        examples=[
            ("黛玉忙止道：“罢了，此刻夜深，明日再看也不迟。”大家又叙了一回，方才安歇。", "黛玉"),
            ("雨村听了大怒道：“岂有这样放屁的事！打死人命就白白的走了，再拿不来的！”因发签差公人立刻将凶犯族中人拿来拷问，令他们实供藏在何处，一面再动海捕文书。", "雨村"),

        ],
    )
    dialogue: str = Field(
        description="对话内容或者内心独白。",
        examples=[
            ("黛玉忙止道：“罢了，此刻夜深，明日再看也不迟。”大家又叙了一回，方才安歇。", "罢了，此刻夜深，明日再看也不迟。大家又叙了一回，方才安歇。"),
            ("雨村听了大怒道：“岂有这样放屁的事！打死人命就白白的走了，再拿不来的！”因发签差公人立刻将凶犯族中人拿来拷问，令他们实供藏在何处，一面再动海捕文书。", "岂有这样放屁的事！打死人命就白白的走了，再拿不来的！因发签差公人立刻将凶犯族中人拿来拷问，令他们实供藏在何处，一面再动海捕文书。"),
        ]
    )
    action: Action = Field(
        description="对话的类型，是对话还是内心独白。",
        examples=[
            ("子兴道：“邪也罢，正也罢，只顾算别人家的帐，你也吃一杯酒才好。”", "对话"),
            ("黛玉心中正疑惑着：“这个宝玉，不知是怎生个惫人物，懵懂顽童？－－倒不见那蠢物也罢了“", "独白"),
        ]
    )

    @validator("speaker")
    def speaker_must_not_be_empty(cls, v):
        if not v:
            raise ValueError("speaker must not be empty")
        return v
    
    @validator("dialogue")
    def dialogue_must_not_be_empty(cls, v):
        if not v:
            raise ValueError("dialogue must not be empty")
        return v
